[
    {
        "id": "LSPACE",
        "names": [
            "L",
            "LSPACE",
            "LOGSPACE",
            "DLOGSPACE"
        ],
        "description": "Deterministic Logarithmic-space is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only a logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/L_(complexity)"
    },
    {
        "id": "NLSPACE",
        "names": [
            "NL",
            "NLSPACE"
        ],
        "description": "Nondeterministic Logarithmic-space is the complexity class of decision problems that can be solved by a nondeterministic Turing machine, using only a logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/NL_(complexity)"
    },
    {
        "id": "PTIME",
        "names": [
            "P",
            "PTIME"
        ],
        "description": "Deterministic Polynomial Time is the complexity class of decision problems that can be solved by a deterministic Turing machine in a polyomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/P_(complexity)"
    },
    {
        "id": "BPP",
        "names": [
            "BPP"
        ],
        "description": "Bounded-error Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probalistic Turing machine in a polyomial amount of computation time with an error probability bounded by 1/3.",
        "wikipedia": "https://en.wikipedia.org/wiki/BPP_(complexity)"
    },
    {
        "id": "ZPP",
        "names": [
            "ZPP"
        ],
        "description": "Zero-error Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probalistic Turing machine in a polyomial amount of computation time without error.",
        "wikipedia": "https://en.wikipedia.org/wiki/ZPP_(complexity)"
    },
    {
        "id": "RP",
        "names": [
            "RP",
            "R"
        ],
        "description": "Randomized Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probalistic Turing machine in a polyomial amount of computation time with 1-sided bounded error.",
        "wikipedia": "https://en.wikipedia.org/wiki/ZPP_(complexity)"
    },
    {
        "id": "NP",
        "names": [
            "NP"
        ],
        "description": "Nodeterministic Polynomial Time is the complexity class of decision problems that can be solved by a nondeterministic Turing machine in a polyomial amount of computation time. It is also defined as the complexity class of decision problems that can be verified by a deterministic Turing machine in a polynomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/NP_(complexity)"
    },
    {
        "id": "PSPACE",
        "names": [
            "PSPACE"
        ],
        "description": "Deterministic Polynomial-space is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only a polynomial amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/PSPACE"
    },
    {
        "id": "EXPTIME",
        "names": [
            "EXPTIME",
            "EXP",
            "DEXPTIME"
        ],
        "description": "Deterministic Exponential Time is the complexity class of decision problems that can be solved by a deterministic Turing machine in an exponential amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/EXPTIME"
    },
    {
        "id": "NEXPTIME",
        "names": [
            "NEXPTIME",
            "NEXP"
        ],
        "description": "Nondeterministic Exponential Time is the complexity class of decision problems that can be solved by a nondeterministic Turing machine in an exponential amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/NEXPTIME"
    },
    {
        "id": "EXPSPACE",
        "names": [
            "EXPSPACE"
        ],
        "description": "Deterministic Exponential-space is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only an exponential amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/EXPSPACE"
    }
]