[
    {
        "id": "LSPACE",
        "names": [
            "L",
            "LSPACE",
            "LOGSPACE",
            "DLOGSPACE"
        ],
        "tags": [
            "SPACE",
            "DETERMINISTIC"
        ],
        "description": "Deterministic Logarithmic-space is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only a logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/L_(complexity)"
    },
    {
        "id": "NLSPACE",
        "names": [
            "NL",
            "NLSPACE"
        ],
        "tags": [
            "SPACE",
            "NONDETERMINISTIC"
        ],
        "description": "Nondeterministic Logarithmic-space is the complexity class of decision problems that can be solved by a nondeterministic Turing machine, using only a logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/NL_(complexity)"
    },
    {
        "id": "CO-NLSPACE",
        "names": [
            "co-NL",
            "co-NLSPACE"
        ],
        "tags": [
            "SPACE",
            "NONDETERMINISTIC",
            "COMPLEMENT"
        ],
        "description": "co-NL is the complement of Nondeterministic Logarithmic-space. This is the complexity class of decision problems that can be solved by a nondeterministic Turing machine, using only a logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/NL_(complexity)"
    },
    {
        "id": "PTIME",
        "names": [
            "P",
            "PTIME"
        ],
        "tags": [
            "TIME",
            "DETERMINISTIC"
        ],
        "description": "Deterministic Polynomial Time is the complexity class of decision problems that can be solved by a deterministic Turing machine in a polynomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/P_(complexity)"
    },
    {
        "id": "BPP",
        "names": [
            "BPP"
        ],
        "tags": [
            "TIME",
            "PROBABILISTIC"
        ],
        "description": "Bounded-error Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probabilistic Turing machine with two-sided error in a polynomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/BPP_(complexity)"
    },
    {
        "id": "ZPP",
        "names": [
            "ZPP"
        ],
        "tags": [
            "TIME",
            "PROBABILISTIC"
        ],
        "description": "Zero-error Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probabilistic Turing machine without error in a polynomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/ZPP_(complexity)"
    },
    {
        "id": "RP",
        "names": [
            "RP",
            "R"
        ],
        "tags": [
            "TIME",
            "PROBABILISTIC"
        ],
        "description": "Randomized Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probabilistic Turing machine with 1-sided bounded error in a polynomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/ZPP_(complexity)"
    },
    {
        "id": "NP",
        "names": [
            "NP"
        ],
        "tags": [
            "TIME",
            "NONDETERMINISTIC"
        ],
        "description": "Nondeterministic Polynomial Time is the complexity class of decision problems that can be solved by a nondeterministic Turing machine in a polynomial amount of computation time. It is also defined as the complexity class of decision problems that can be verified by a deterministic Turing machine in a polynomial amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/NP_(complexity)"
    },
    {
        "id": "PSPACE",
        "names": [
            "PSPACE"
        ],
        "tags": [
            "SPACE",
            "DETERMINISTIC"
        ],
        "description": "Deterministic Polynomial-space is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only a polynomial amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/PSPACE"
    },
    {
        "id": "EXPTIME",
        "names": [
            "EXPTIME",
            "EXP",
            "DEXPTIME"
        ],
        "tags": [
            "TIME",
            "DETERMINISTIC"
        ],
        "description": "Deterministic Exponential Time is the complexity class of decision problems that can be solved by a deterministic Turing machine in an exponential amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/EXPTIME"
    },
    {
        "id": "NEXPTIME",
        "names": [
            "NEXPTIME",
            "NEXP"
        ],
        "tags": [
            "TIME",
            "NONDETERMINISTIC"
        ],
        "description": "Nondeterministic Exponential Time is the complexity class of decision problems that can be solved by a nondeterministic Turing machine in an exponential amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/NEXPTIME"
    },
    {
        "id": "EXPSPACE",
        "names": [
            "EXPSPACE"
        ],
        "tags": [
            "SPACE",
            "DETERMINISTIC"
        ],
        "description": "Deterministic Exponential-space is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only an exponential amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/EXPSPACE"
    },
    {
        "id": "NEXPSPACE",
        "names": [
            "NEXPSPACE"
        ],
        "tags": [
            "SPACE",
            "NONDETERMINISTIC"
        ],
        "description": "Nondeterministic Exponential-space is the complexity class of decision problems that can be solved by a nondeterministic Turing machine, using only an exponential amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/NEXPSPACE"
    },
    {
        "id": "NC",
        "names": [
            "NC"
        ],
        "tags": [
            "TIME",
            "DETERMINISTIC"
        ],
        "description": "Nick's Class is the complexity class of decision problems that can be solved by a parallel computer with a polynomial number of processors in a polylogarithmic amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/NC_(complexity)"
    },
    {
        "id": "NC1",
        "names": [
            "NC^1"
        ],
        "tags": [
            "TIME",
            "DETERMINISTIC"
        ],
        "description": "NC^1 is the complexity class of decision problems that can be solved by a parallel computer with a polynomial number of processors in a O(log n) amount of computation time.",
        "wikipedia": "https://en.wikipedia.org/wiki/NC_(complexity)#The_NC_hierarchy"
    },
    {
        "id": "L/POLY",
        "names": [
            "L/poly"
        ],
        "tags": [
            "SPACE",
            "DETERMINISTIC"
        ],
        "description": "L/poly is the complexity class of decision problems that can be solved by a deterministic Turing machine, using only an logarithmic amount of writable memory space and with advice strings of polynomial length.",
        "wikipedia": "https://en.wikipedia.org/wiki/L/poly"
    },
    {
        "id": "P/POLY",
        "names": [
            "P/poly"
        ],
        "tags": [
            "TIME",
            "DETERMINISTIC"
        ],
        "description": "P/poly is the complexity class of decision problems that can be solved by a deterministic Turing machine in a polynomial amount of time with advice strings of polynomial length.",
        "wikipedia": "https://en.wikipedia.org/wiki/P/poly"
    },
    {
        "id": "NP/POLY",
        "names": [
            "NP/poly"
        ],
        "tags": [
            "TIME",
            "NONDETERMINISTIC"
        ],
        "description": "P/poly is the complexity class of decision problems that can be solved by a nondeterministic Turing machine in a polynomial amount of time with advice strings of polynomial length.",
        "wikipedia": "https://en.wikipedia.org/wiki/NP/poly"
    },
    {
        "id": "BPL",
        "names": [
            "BPL",
            "BPLP"
        ],
        "tags": [
            "SPACE",
            "PROBABILISTIC"
        ],
        "description": "Bounded-error Probabilistic Logarithmic-space is the complexity class of decision problems that can be solved by a probabilistic Turing machine with two-sided error, using only an logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/BPL_(complexity)"
    },
    {
        "id": "RL",
        "names": [
            "RL",
            "RLP"
        ],
        "tags": [
            "SPACE",
            "PROBABILISTIC"
        ],
        "description": "Randomized Logarithmic-space is the complexity class of decision problems that can be solved by a probabilistic Turing machine with 1-sided error, using only an logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/RL_(complexity)"
    },
    {
        "id": "PL",
        "names": [
            "PL"
        ],
        "tags": [
            "SPACE",
            "PROBABILISTIC"
        ],
        "description": "Probabilistic Logarithmic-space  is the complexity class of decision problems that can be solved by a probabilistic Turing machine with unbounded error, using only an logarithmic amount of writable memory space.",
        "wikipedia": "https://en.wikipedia.org/wiki/PL_(complexity)"
    },
    {
        "id": "PP",
        "names": [
            "PP",
            "PPT"
        ],
        "tags": [
            "TIME",
            "PROBABILISTIC"
        ],
        "description": "Probabilistic Polynomial Time is the complexity class of decision problems that can be solved by a probabilistic Turing machine with unbounded error  in a polynomial amount of time.",
        "wikipedia": "https://en.wikipedia.org/wiki/PP_(complexity)"
    }

]